{"The Central Intelligence Agency on Monday evening slammed what it called CNN's \"misguided\" and \"simply false\" reporting, after the cable channel's chief national security correspondent authored a hole-filled piece claiming that the CIA had pulled a high-level spy out of Russia because President Trump had \"repeatedly mishandled classified intelligence and could contribute to exposing the covert source as a spy.\"": null, "The extraordinary CIA rebuke came as The New York Times published a bombshell piece late in the evening, which largely contradicted CNN's reporting. According to the Times, CIA officials \"made the arduous decision in late 2016 to offer to extract the source from Russia\" — weeks before Trump even took office.": null, "Concerns about media reporting on Russian election interference drove the decision, according to the Times, which described the source as \"the American government’s best insight into the thinking of and orders” from Russian President Vladimir Putin.": null, "\"Former intelligence officials said there was no public evidence that Mr. Trump directly endangered the source, and other current American officials insisted that media scrutiny of the agency’s sources alone was the impetus for the extraction,\" the Times wrote.": null, "FBI STILL SILENT AFTER SENATE CMTE PROBES KEY TRUMP TOWER INTEL BRIEFING -- WHICH RAISED QUESTIONS ABOUT LEAKS TO CNN": null, "The purported spy refused the 2016 offer of extraction, the Times reported, citing family concerns. But the CIA \"pressed again months later after more media inquiries\" threatened the source, and he relented, according to the paper.": null, "The whirlwind developments continued into the night on Monday, when NBC News exclusively reported that a possible Russia spy was now living under apparent U.S. protection, using his true identity, in Washington, D.C. — and that his life could be in danger. Sources told NBC News that the Russian living in Washington was the same individual who was referenced in the reporting by CNN and the Times, and NBC said he \"fits the profile of someone who may have had access to information about Putin’s activities.\"": null, "An NBC reporter who knocked at the Russian's door was confronted by unidentified men in an SUV, presumed to be security personnel, within minutes. Speculation about the purported spy's identity, using publicly available records, quickly circulated on social media after NBC News' report revealed identifiable details about his living situation. Russian officials reportedly said the man at the center of those reports worked in the presidential administration but was fired and did not have direct access to Putin.": null, "\"CNN's narrative that the Central Intelligence Agency makes life-or-death decisions based on anything other than objective analysis and sound collection is simply false,\" CIA Director for Public Affairs Brittany Bramell said in the agency's statement.": null, "Bramwell continued: \"Misguided speculation that the President's handling of our nation's most sensitive intelligence — which he has access to each and every day — drove an alleged exfiltration operation is inaccurate.\"": null, "DISPUTE ERUPTS OVER WHETHER COMEY, BRENNAN PUSHED DOSSIER; INTEL CHIEF LEAKED DOSSIER BRIEFING TO CNN, KICKSTARTING RUSSIA NARRATIVE": null, "According to the report by CNN chief national correspondent and former Obama administration official Jim Sciutto, the decision to carry out the extraction \"occurred soon after a May 2017 meeting in the Oval Office in which Trump discussed highly classified intelligence with Russian Foreign Minister Sergey Lavrov and then-Russian Ambassador to the US Sergey Kislyak. The intelligence, concerning ISIS in Syria, had been provided by Israel.\"": null, "The disclosure \"prompted intelligence officials to renew earlier discussions about the potential risk of exposure,\" CNN reported.": null, "Sciutto later posted on Twitter, after the Times report was published, that the double agent in jeopardy had the \"remarkable ability to take photos of presidential documents,\" as well as \"direct access\" to Putin.": null, "It was not clear from the CNN piece how exactly Trump's comments in the Oval Office would have further compromised the Russian source.": null, "Numerous other holes quickly surfaced in CNN's reporting. Commentator Aaron Mate pointed out in a Twitter thread that several major news organizations had previously cited a high-level official in the Russian government as a source -- suggesting that the intelligence community itself, not Trump, had compromised the spy.": null, "For example, The Washington Post reported in June 2017 of \"'sourcing deep inside the Russian government' -- so deep that it purportedly 'captured Putin’s specific instructions' to launch a pro-Trump influence campaign,\" Mate noted.": null, "GRAHAM HITS CNN FOR HIRING FMR FBI HEAD ANDREW MCCABE, WHO WAS FIRED FOR LYING UNDER OATH": null, "And the Times reported in August 2018 of \"anonymous intel officials complaining that their 'vital Kremlin informants have largely gone silent.'\" But \"if these Kremlin informants are so vital, why are US intel officials talking about them?\" Mate asked.": null, "The source resurfaced in May 2019, when the Times \"reported on intel fears of this source being exposed.\"": null, "\"Again, the irony is lost that it's the ones who are complaining who are the ones revealing this supposed source,\" Mate wrote. \"So there's a pattern here of intel leaks in order to: create a false link between Trump-Russia; to reveal supposed high-level Russian sources that advance the Russiagate narrative & then falsely blame Trump for these sources' supposed vulnerability.\"": null, "Fox News understands that the CIA typically makes the decision to withdraw an asset only after a long deliberative process, and that the move would not ordinarily be taken based on a single event involving classified information, as CNN implied.": null, "CNN has been faulted for its inaccurate intelligence reporting in the past. In December 2017, CNN falsely reported that Donald Trump, Jr. had advance access to hacked WikiLeaks emails, in what Glenn Greenwald called \"one of the most humiliating spectacles in the history of the U.S. media.\" Several of the organization's much-touted journalists were forced out earlier that year for a separate false Russia bombshell.": null, "TRUMP TEARS INTO MSNBC AFTER RUSSIA BOMBSHELL GOES BUST IN LESS THAN 24 HOURS": null, "CNN did not immediately reply to Fox News' request for comment. Sciutto claimed on CNN's \"Anderson Cooper 360\" late Monday that the Times had \"confirmed\" his reporting. Numerous other news organizations, including Vox, The Hill, and the Guardian, picked up CNN's original story uncritically.": null, "The developments led to speculation as to who had leaked the information to CNN -- especially in light of previous anti-Trump leaks that found their way from the intelligence community to CNN's airwaves -- and led commentators to again fault the accuracy of CNN's initial reporting.": null, "CLICK HERE TO GET THE FOX NEWS APP": null, "\"In their fervor to blame President Trump for mishandling classified information, CNN potentially risked lives,\" a source familiar with the matter told The Daily Wire. \"They had multiple on-the-record quotes from Administration officials telling them. Their story was not only wrong, but irresponsible and dangerous, and CNN decided to run with it anyway.\"": null, "Fox News' Catherine Herridge contributed to this report.": null}{"Sen. Kamala Harris, D-Calif., expressed her support for a mandatory buyback program for \"assault weapons\" on Monday during her appearance on \"The Tonight Show Starring Jimmy Fallon.\"": null, "Towards the end of her interview, she took questions from the audience, made up of mostly college students. One of them had pressed Harris about her stance on guns.": null, "\"Do you believe in the mandatory buyback of quote-unquote assault weapons and whether or not you do, how does that idea not go against fundamentally the Second Amendment?\" Andrew from Fordham University asked.": null, "CNN PUNDIT RIPS BETO O'ROURKE'S VOW TO SEIZE GUNS: IT SIGNIFICANTLY INCREASES THE CHANCES' OF TRUMP'S REELECTION": null, "\"Great question. I do believe that we need to do buybacks and I'll tell you why,\" Harris responded. \"First of all, let's be clear about what assault weapons are. They have been designed to kill a lot of human beings quickly. They are weapons of war with no place on the streets of a civil society. I've seen assault weapons kill babies and police officers.\"": null, "The 2020 hopeful then reiterated her threat of executive order as president if Congress doesn't act on gun reform, but stressed that the \"over 2 million\" assault weapons currently in the streets need to be addressed.": null, "\"A buyback program is a good idea. Now we need to do it the right way,\" Harris continued. \"And part of that has to be, you know, buy back and give people their value, the financial value of what they have and not just take things from people that have value without compensating them. We need to do it the right way.\"": null, "CLICK HERE TO GET THE FOX NEWS APP": null, "This comes just days after former congressman Beto O'Rourke proudly declared for a gun seizure at last week's Democratic debate.": null, "\"Hell yes, we're going to take your AR-15, your AK-47. We're not going to allow it to be used against our fellow Americans anymore,\" O'Roukre vowed.": null}{"Sen. Dick Durbin, D-Ill., was asked Monday about the prospects of Democrats taking up an effort to impeach Supreme Court Associate Justice Brett Kavanaugh and he responded, “Get real,” according to a report.": null, "Calls to impeach Kavanaugh came after an essay in The New York Times brought to light separate sexual misconduct allegations against him dating back to his time at Yale University. The Times reported that the FBI did not investigate the claim.": null, "The paper was forced to run an editor’s note and revise the essay after it was revealed that it left out that the accuser declined to be interviewed and her friends said she doesn’t recall the incident.": null, "NYT REPORTERS BEHIND KAVANAUGH STORY SUGGEST KEY INFORMATION WAS REMOVED BY EDITORS": null, "The report prompted 2020 Democrats to call for Kavanaugh's ouster. The new push to impeach Kavanaugh appeared to divide Democrats still eyeing an effort to impeach President Trump.": null, "“We’ve got to get beyond this ‘impeachment is the answer to every problem,” Durbin said, according to Politico. “It’s not realistic. If that’s how we are identified in Congress, as the impeachment Congress, we run the risk that people will feel we’re ignoring the issues that mean a lot to them as families.”": null, "Rep. Jerry Nadler, the New York Democrat and chair of the House Judiciary Committee, said the committee will ask Christopher Wray, the FBI director, about the investigation during a later hearing. Nadler stressed that his focus is on impeaching Trump.": null, "GET THE FOX NEWS APP": null, "A Kavanaugh impeachment would require a majority vote in the Democratic-controlled House, and two-thirds vote in the GOP-majority Senate.": null, "Rep. Ayanna Pressley, D-Mass., will reportedly file an impeachment resolution on Tuesday. She said he must be \"held accountable for his actions.\"": null, "Fox News' Gregg Re contributed to this report.": null}{"Iran was the staging ground for the weekend attacks on the massive Saudi Arabia oil field, according to U.S. intelligence that was shared with the kingdom, a report said.": null, "The Wall Street Journal, citing unnamed sources, reported that the intelligence report—that was not shared publicly—indicated that Iran raided the massive oil field with at least a dozen missiles and 20 drones.": null, "The State Department did not immediately respond to an after-hours email from Fox News on Tuesday morning. The Journal's report said that a Saudi official indicated that the U.S. intelligence was not definitive. The official told the paper that the U.S. did not provide enough evidence to prove without a doubt that Tehran’s hand was involved.": null, "President Trump has said the U.S. is “locked and loaded” and able to respond to the threat but also said he wants to avoid war. Iran has denied any involvement in the attack. Ahead of UN meeting, Iran's Supreme Leader Ayatollah Ali Khamenei said \"there will be no talks with the US at any level,\" the Associated Press reported.": null, "Yemen's Iran-backed Houthi rebels claimed responsibility for the attack on Saturday, sparking huge fires and halting about half of the supplies from the world's largest exporter of oil. The attack was seen by some analysts as a Pearl Harbor-like event.": null, "GET THE FOX NEWS APP": null, "The fires led to the interruption of an estimated 5.7 million barrels in crude supplies, as Saudi officials said part of that would be offset with stockpiles.": null, "Fox News' Alex Pappas contributed to this report": null}{"Sen. Kamala Harris, D-Calif., reiterated her call for the impeachment of Supreme Court Justice Brett Kavanaugh following the criticized New York Times story that revived sexual misconduct allegations.": null, "Appearing on MSNBC Monday night, Harris referred to Kavanaugh's confirmation as a \"sham process,\" claiming she wasn't \"given all of the information\" at the time that was available.": null, "\"Christine Blasey Ford, who literally had nothing to gain by coming forward... nothing to gain. She had a perfect life. And she looked at the fact that this guy was being nominated and said, 'the American people had the right to know what I know,' and she was treated like a criminal,\" Harris said.": null, "The 2020 hopeful blasted the White House for limiting the scope of the FBI investigation into Kavanaugh and said the process that confirmed him \"has created a crisis of confidence in that court.\"": null, "TRUMP RIPS NEW YORK TIMES OVER KAVANAUGH PIECE, CALLS FOR RESIGNATION OF ANYONE INVOLVED IN 'SMEAR STORY'": null, "\"So yes, I call for impeachment,\" Harris told MSNBC host Rachel Maddow. \"I believe that is the clearest way for us to get an investigation of these allegations and we should open an investigation of these allegations.\"": null, "She added that \"the American people and the system of justice\" deserve a meaningful investigation and later suggested an \"outside counsel.\"": null, "CLICK HERE TO GET THE FOX NEWS APP": null, "Over the weekend, before The Times issued the major revision clarifying that the alleged accuser did not recall the alleged assault, Harris among other presidential candidates called for Kavanaugh's impeachment.": null, "\"I sat through those hearings. Brett Kavanaugh lied to the U.S. Senate and most importantly to the American people. He was put on the Court through a sham process and his place on the Court is an insult to the pursuit of truth and justice. He must be impeached,\" Harris wrote.": null}